---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CouplerNumber
source: html/bef1c6b9-2657-9def-f564-d09e1603bbdb.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CouplerNumber Property

"Coupler Number"

## Syntax (C#)
```csharp
public static ForgeTypeId CouplerNumber { get; }
```